---
kind: enumMember
id: F:Autodesk.Revit.DB.Visibility.Visible
enum: Autodesk.Revit.DB.Visibility
source: html/0927cebc-d2fc-3411-26d7-1927f3b68e09.htm
---
# Autodesk.Revit.DB.Visibility.Visible

The geometry object is always visible. This type of geometry is always returned by
 Geometry[Options]